{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_73",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "dense_219_input"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_219",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "units": 70,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 0.0
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_219",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_220",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 25,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 0.0
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_220",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_221",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 0.0
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_221",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "softmax"
                }
            }
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}