{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_46",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "dense_148_input"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_148",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_148",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_149",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_149",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_150",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_150",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_151",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_151",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_152",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_152",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_153",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_153",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_154",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_154",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_155",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_155",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_156",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_156",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_157",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_157",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_158",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_158",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "softmax"
                }
            }
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}