{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_48",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "dense_162_input"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_162",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "units": 70,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_162",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_163",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 60,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_163",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_164",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 60,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_164",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_165",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_165",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_166",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999747378752e-06
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_166",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "softmax"
                }
            }
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}